In [1]:
import pandas as pd

# Categorical to Numerical Conversion
    
    Pandas has get_dummies to convert categorical features to Numerical features, so that they can be used to train any model

In [2]:
df = pd.DataFrame({'name':['qw','we','er','rt'],'sex':['m','f','f','m']})

In [3]:
df

  name sex
0   qw   m
1   we   f
2   er   f
3   rt   m

In [6]:
pd.get_dummies(df)

   name_er  name_qw  name_rt  name_we  sex_f  sex_m
0        0        1        0        0      0      1
1        0        0        0        1      1      0
2        1        0        0        0      1      0
3        0        0        1        0      0      1

In [8]:
df_sex_categorical_num = pd.get_dummies(df.sex)

In [9]:
df_sex_categorical_num

   f  m
0  0  1
1  1  0
2  1  0
3  0  1

In [10]:
df_new = df.join(df_sex_categorical_num)

In [11]:
df_new

  name sex  f  m
0   qw   m  0  1
1   we   f  1  0
2   er   f  1  0
3   rt   m  0  1